; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v11)
             (pred_10 ?v6 ?v7)
             (pred_8 ?v10 ?v7)
             (pred_12 ?v8 ?v10 )
	     (pred_3 ?v10)
             (pred_2 ?v13)
             (pred_7 ?v6)
             (pred_6 ?v7)
             (pred_4 ?v10)
             (pred_5 ?v6)
             (pred_1 ?v10)
             (pred_11 ))



(:action op_2
:parameters (?v3 ?v5 ?v2 ?v4)
:precondition (and (pred_2 ?v3) (pred_2 ?v5) (pred_7 ?v2) (pred_6 ?v4)
          (pred_9 ?v3 ?v5) (pred_10 ?v2 ?v4)
                   (pred_8 ?v5 ?v4) (pred_3 ?v3) 
                   (pred_4 ?v5) (pred_5 ?v2))
:effect (and  (pred_1 ?v5) (not (pred_4 ?v5))))


(:action op_4
:parameters (?v3 ?v12)
:precondition (and (pred_2 ?v3) (pred_2 ?v12)
               (pred_3 ?v3) (pred_9 ?v3 ?v12) (pred_1 ?v12))
:effect (and (pred_3 ?v12) (not (pred_3 ?v3))))

(:action op_1
:parameters (?v3 ?v2)
:precondition (and (pred_2 ?v3) (pred_7 ?v2) 
                  (pred_3 ?v3) (pred_12 ?v2 ?v3) (pred_11 ))
:effect (and (pred_5 ?v2)
   (not (pred_12 ?v2 ?v3)) (not (pred_11 ))))


(:action op_3
:parameters (?v3 ?v9 ?v1)
:precondition (and (pred_2 ?v3) (pred_7 ?v9) (pred_7 ?v1)
                  (pred_3 ?v3) (pred_5 ?v1) (pred_12 ?v9 ?v3))
:effect (and (pred_5 ?v9) (pred_12 ?v1 ?v3)
        (not (pred_5 ?v1)) (not (pred_12 ?v9 ?v3))))

(:action op_5
:parameters (?v3 ?v2)
:precondition (and (pred_2 ?v3) (pred_7 ?v2) 
                  (pred_3 ?v3) (pred_5 ?v2))
:effect (and (pred_11 ) (pred_12 ?v2 ?v3) (not (pred_5 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_21 obj_09 obj_20 obj_07 obj_08 obj_15 obj_03 obj_05 obj_12 obj_16 obj_18 obj_11 obj_19 obj_10 obj_01
    obj_14 obj_13
    obj_02 obj_17 obj_04
    )

    (:init
       (pred_11)

       (pred_2 obj_06)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_15)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_18)
       (pred_2 obj_11)
       (pred_2 obj_19)
       (pred_2 obj_10)
       (pred_2 obj_01)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_7 obj_02)
       (pred_7 obj_17)
       (pred_7 obj_04)

       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_21 obj_08)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_20)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_09)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_08 obj_21)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_12)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_12 obj_19)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_12 obj_05)
       (pred_9 obj_16 obj_10)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_12)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_16)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_10)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_06)
       (pred_8  obj_18 obj_14)
       (pred_8  obj_21 obj_13)
       (pred_8  obj_06 obj_14)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_1 obj_07)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_03)
       (pred_1 obj_05)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_10)
       (pred_1 obj_01)

       (pred_10  obj_02 obj_14)
       (pred_10  obj_17 obj_13)
       (pred_10  obj_04 obj_14)
       (pred_12 obj_02 obj_15)
       (pred_12 obj_17 obj_01)
       (pred_12 obj_04 obj_09)
       (pred_3 obj_01)
    )

    (:goal (and
       (pred_12 obj_02 obj_19)
       (pred_12 obj_17 obj_03)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_4 obj_01 obj_10)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_10)
   goals met: 0 of 2
2. (op_4 obj_10 obj_19)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_19)
   goals met: 0 of 2
3. (op_4 obj_19 obj_12)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_12)
   goals met: 0 of 2
4. (op_4 obj_12 obj_08)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_08)
   goals met: 0 of 2
5. (op_4 obj_08 obj_15)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_15)
   goals met: 0 of 2
6. (op_1 obj_15 obj_02)
   deleted: (pred_12 obj_02 obj_15) (pred_11)
   added: (pred_5 obj_02)
   goals met: 0 of 2
7. (op_4 obj_15 obj_03)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_03)
   goals met: 0 of 2
8. (op_2 obj_03 obj_18 obj_02 obj_14)
   deleted: (pred_4 obj_18)
   added: (pred_1 obj_18)
   goals met: 0 of 2
9. (op_4 obj_03 obj_18)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_18)
   goals met: 0 of 2
10. (op_4 obj_18 obj_01)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_01)
   goals met: 0 of 2
11. (op_4 obj_01 obj_10)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_10)
   goals met: 0 of 2
12. (op_4 obj_10 obj_19)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_19)
   goals met: 0 of 2
13. (op_5 obj_19 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_11) (pred_12 obj_02 obj_19)
   goals met: 1 of 2
14. (op_4 obj_19 obj_10)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_10)
   goals met: 1 of 2
15. (op_4 obj_10 obj_01)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_01)
   goals met: 1 of 2
16. (op_1 obj_01 obj_17)
   deleted: (pred_12 obj_17 obj_01) (pred_11)
   added: (pred_5 obj_17)
   goals met: 1 of 2
17. (op_4 obj_01 obj_18)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_18)
   goals met: 1 of 2
18. (op_4 obj_18 obj_03)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_03)
   goals met: 1 of 2
19. (op_5 obj_03 obj_17)
   deleted: (pred_5 obj_17)
   added: (pred_11) (pred_12 obj_17 obj_03)
   goals met: 2 of 2
